# EXTRA ANALYSIS

In [23]:
#IMPORTING DEPENDENCIES
from sqlalchemy import create_engine
import pandas as pd
from config import password

In [24]:
# CREATING CONNECTION TO POSTGRESQL DATABASE
engine = create_engine(f'postgres+psycopg2://postgres:{password}@localhost:5433/employee_db')
connection = engine.connect()

In [25]:
# Query All Records in the the Employee table
employees = pd.read_sql("SELECT * FROM employees e, salaries s WHERE e.emp_no=s.emp_no;", connection)
# Preview the Data
employees.head()

,emp_no,emp_title_id,birth_date,first_name,last_name,sex,hire_date,emp_no,salary
0,10005,s0001,1/21/1955,Kyoichi,Maliniak,M,9/12/1989,10005,78228
1,10010,e0002,6/1/1963,Duangkaew,Piveteau,F,8/24/1989,10010,72488
2,10011,s0001,11/7/1953,Mary,Sluis,F,1/22/1990,10011,42365
3,10013,s0002,6/7/1963,Eberhardt,Terkki,M,10/20/1985,10013,40000
4,10017,s0001,7/6/1958,Cristinel,Bouloucos,F,8/3/1993,10017,71380

In [26]:
employees.count()

emp_no          300024
emp_title_id    300024
birth_date      300024
first_name      300024
last_name       300024
sex             300024
hire_date       300024
emp_no          300024
salary          300024
dtype: int64